package sfr

import (
	"encoding/xml"
	"fmt"
)

func ExampleNewAddress() {
	addr := NewAddressRus().
		WithZipCode("397140").
		WithRegion("обл Тамбовская").
		WithCity("г Тамбов").
		WithStreet("ул Советская").
		WithHouse("д 10").
		WithBuilding("стр 1").
		WithFlat("кв 1")

	xmlBytes, err := xml.MarshalIndent(addr, "", "  ")
	if err != nil {
		panic(err)
	}

	fmt.Println(string(xmlBytes))

	// Output: <AddressRus>
	//   <УТ:Индекс>397140</УТ:Индекс>
	//   <УТ:РоссийскийАдрес>
	//     <УТ:Регион>
	//       <УТ:Название>обл Тамбовская</УТ:Название>
	//     </УТ:Регион>
	//     <УТ:Город>
	//       <УТ:Название>г Тамбов</УТ:Название>
	//     </УТ:Город>
	//     <УТ:Улица>
	//       <УТ:Название>ул Советская</УТ:Название>
	//     </УТ:Улица>
	//     <УТ:Дом>
	//       <УТ:Номер>д 10</УТ:Номер>
	//     </УТ:Дом>
	//     <УТ:Строение>
	//       <УТ:Номер>стр 1</УТ:Номер>
	//     </УТ:Строение>
	//     <УТ:Квартира>
	//       <УТ:Номер>кв 1</УТ:Номер>
	//     </УТ:Квартира>
	//   </УТ:РоссийскийАдрес>
	// </AddressRus>
}
